# Pandas  
- Analayse 2D or multi dimensional data
- Table like data
- Internally they use nump
- Has commonalities with SQL but they way they are achieved is not the same

In [1]:
import pandas as pd

In [4]:
data= {'Name':['John','Anna','Peter','Linda'],
       'Age':[28,34,29,32],
       'City':['New York','Paris','Berlin','London']}
data

{'Name': ['John', 'Anna', 'Peter', 'Linda'],
 'Age': [28, 34, 29, 32],
 'City': ['New York', 'Paris', 'Berlin', 'London']}

## Creating DataFrame

In [5]:
df= pd.DataFrame(data)   ### Create table form and gives it index

In [75]:
df['Name']       ##Got name column

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

## First two rows
- select * from df limit 2

In [76]:
df.head(2)    ## gives me the first two rows

   Name  Age      City
0  John   28  New York
1  Anna   34     Paris

In [77]:
df.head()    ## see all rows

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

In [6]:
import numpy as np

In [79]:
items = np.array(
    [
        " Apple",
        "banana ",
        "GRAPE",
        "cucumber",
        "Pineapple",
        " tomato ",
        "Orange",
        " lemon",
        "Kiwi ",
        "mango",
        "blueberry ",
        " raspberry",
    ]
)

print(type(items))
print(type(items[0]))

<class 'numpy.ndarray'>
<class 'numpy.str_'>

## Info about data
- fell for the data
- if not int then it will be marked as an object
- dtypes-> datatypes
- columns
- space occupied
- null values

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [81]:
df.shape #(rows, columns)

(4, 3)

In [7]:
df.dtypes  #datatypes in df

Name    object
Age      int64
City    object
dtype: object

In [8]:
df.columns   ## column names in table

Index(['Name', 'Age', 'City'], dtype='object')

In [84]:
df.describe()  #does stats for int column in table

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

In [85]:
df.describe(include='all')  #force to give stats for all columns

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

## Task
1. Load CSV as dataframe
2. Get first 5 rows
3. Get a feel for the dataframe -> feel for the table
4. Get a feel for the data (Preliminary summarized info)

In [9]:
tips_df=pd.read_csv('./tips.csv')

In [87]:
tips_df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [88]:
tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [89]:
tips_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [90]:
tips_df.describe(include="all")

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

In [15]:
tips_df[['tip','day','time']]   ## get multiple columns in table

      tip   day    time
0    1.01   Sun  Dinner
1    1.66   Sun  Dinner
2    3.50   Sun  Dinner
3    3.31   Sun  Dinner
4    3.61   Sun  Dinner
..    ...   ...     ...
239  5.92   Sat  Dinner
240  2.00   Sat  Dinner
241  2.00   Sat  Dinner
242  1.75   Sat  Dinner
243  3.00  Thur  Dinner

[244 rows x 3 columns]

In [16]:
tips_df[["tip", "day", "time"]].head(10)   ##Limit to first 10 rows

    tip  day    time
0  1.01  Sun  Dinner
1  1.66  Sun  Dinner
2  3.50  Sun  Dinner
3  3.31  Sun  Dinner
4  3.61  Sun  Dinner
5  4.71  Sun  Dinner
6  2.00  Sun  Dinner
7  3.12  Sun  Dinner
8  1.96  Sun  Dinner
9  3.23  Sun  Dinner

In [93]:
tips_df['tips_per_person']= tips_df["tip"] / tips_df["size"]   ## Get tips per person
tips_df                                                        ## added a column and altered table

     total_bill   tip     sex smoker   day    time  size  tips_per_person
0         16.99  1.01  Female     No   Sun  Dinner     2         0.505000
1         10.34  1.66    Male     No   Sun  Dinner     3         0.553333
2         21.01  3.50    Male     No   Sun  Dinner     3         1.166667
3         23.68  3.31    Male     No   Sun  Dinner     2         1.655000
4         24.59  3.61  Female     No   Sun  Dinner     4         0.902500
..          ...   ...     ...    ...   ...     ...   ...              ...
239       29.03  5.92    Male     No   Sat  Dinner     3         1.973333
240       27.18  2.00  Female    Yes   Sat  Dinner     2         1.000000
241       22.67  2.00    Male    Yes   Sat  Dinner     2         1.000000
242       17.82  1.75    Male     No   Sat  Dinner     2         0.875000
243       18.78  3.00  Female     No  Thur  Dinner     2         1.500000

[244 rows x 8 columns]

# Find the how much percentage people are tiping
 
- Find tip percentage
- Add it as another column - tip_percent
- Round off to 2 decimal
- `20.34` not be `0.243`

In [17]:
tips_df['tip_percent']= round((tips_df['tip']/tips_df['total_bill'])*100,2)
tips_df

     total_bill   tip     sex smoker   day    time  size  tip_percent
0         16.99  1.01  Female     No   Sun  Dinner     2         5.94
1         10.34  1.66    Male     No   Sun  Dinner     3        16.05
2         21.01  3.50    Male     No   Sun  Dinner     3        16.66
3         23.68  3.31    Male     No   Sun  Dinner     2        13.98
4         24.59  3.61  Female     No   Sun  Dinner     4        14.68
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3        20.39
240       27.18  2.00  Female    Yes   Sat  Dinner     2         7.36
241       22.67  2.00    Male    Yes   Sat  Dinner     2         8.82
242       17.82  1.75    Male     No   Sat  Dinner     2         9.82
243       18.78  3.00  Female     No  Thur  Dinner     2        15.97

[244 rows x 8 columns]

## Task 1
- Filter the rows where people dined on a Sunday
- Clue: Boolean matrix

In [18]:
filt_row= tips_df['day']=='Sun'
tips_df[filt_row]

     total_bill   tip     sex smoker  day    time  size  tip_percent
0         16.99  1.01  Female     No  Sun  Dinner     2         5.94
1         10.34  1.66    Male     No  Sun  Dinner     3        16.05
2         21.01  3.50    Male     No  Sun  Dinner     3        16.66
3         23.68  3.31    Male     No  Sun  Dinner     2        13.98
4         24.59  3.61  Female     No  Sun  Dinner     4        14.68
..          ...   ...     ...    ...  ...     ...   ...          ...
186       20.90  3.50  Female    Yes  Sun  Dinner     3        16.75
187       30.46  2.00    Male    Yes  Sun  Dinner     5         6.57
188       18.15  3.50  Female    Yes  Sun  Dinner     3        19.28
189       23.10  4.00    Male    Yes  Sun  Dinner     3        17.32
190       15.69  1.50    Male    Yes  Sun  Dinner     2         9.56

[76 rows x 8 columns]

## Task 2
Get the rows where person have tipped more than R3 on a Friday

In [19]:
tips_three_fri = tips_df[(tips_df["tip"] > 3) & (tips_df["day"] == "Fri")]
tips_three_fri

     total_bill   tip     sex smoker  day    time  size  tip_percent
91        22.49  3.50    Male     No  Fri  Dinner     2        15.56
93        16.32  4.30  Female    Yes  Fri  Dinner     2        26.35
94        22.75  3.25  Female     No  Fri  Dinner     2        14.29
95        40.17  4.73    Male    Yes  Fri  Dinner     4        11.77
96        27.28  4.00    Male    Yes  Fri  Dinner     2        14.66
221       13.42  3.48  Female    Yes  Fri   Lunch     2        25.93

In [21]:
tips_three_fri.sort_values(by="tip", ascending=False).head(5)

     total_bill   tip     sex smoker  day    time  size  tip_percent
95        40.17  4.73    Male    Yes  Fri  Dinner     4        11.77
93        16.32  4.30  Female    Yes  Fri  Dinner     2        26.35
96        27.28  4.00    Male    Yes  Fri  Dinner     2        14.66
91        22.49  3.50    Male     No  Fri  Dinner     2        15.56
221       13.42  3.48  Female    Yes  Fri   Lunch     2        25.93

# Task 4
Rows where - Large parties:  people are 5 or more or they spend R35 or more

In [110]:
tips_df[(tips_df["size"] >= 5) | (tips_df["total_bill"] > 35)]

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percent
11,35.26,5.00,Female,No,Sun,Dinner,4,1.250000,14.18
23,39.42,7.58,Male,No,Sat,Dinner,4,1.895000,19.23
56,38.01,3.00,Male,Yes,Sat,Dinner,4,0.750000,7.89
59,48.27,6.73,Male,No,Sat,Dinner,4,1.682500,13.94
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.182500,11.77
102,44.30,2.50,Female,Yes,Sat,Dinner,3,0.833333,5.64
112,38.07,4.00,Male,No,Sun,Dinner,3,1.333333,10.51
125,29.80,4.20,Female,No,Thur,Lunch,6,0.700000,14.09
141,34.30,6.70,Male,No,Thur,Lunch,6,1.116667,19.53
142,41.19,5.00,Male,No,Thur,Lunch,5,1.000000,12.14
143,27.05,5.00,Female,No,Thur,Lunch,6,0.833333,18.48
155,29.85,5.14,Female,No,Sun,Dinner,5,1.028000,17.22
156,48.17,5.00,Male,No,Sun,Dinner,6,0.833333,10.38
170,50.81,10.00,Male,Yes,Sat,Dinner,3,3.333333,19.68
182,45.35,3.50,Male,Yes,Sun,Dinner,3,1.166667,7.72
184,40.55,3.00,Male,Yes,Sun,Dinner,2,1.500000,7.40
185,20.69,5.00,Male,No,Sun,Dinner,5,1.000000,24.17
187,30.46,2.00,Male,Yes,Sun,Dinner,5,0.400000,6.57
197,43.11,5.00,Female,Yes,Thur,Lunch,4,1.250000,11.60
207,38.73,3.00,Male,Yes,Sat,Dinner,4,0.750000,7.75
212,48.33,9.00,Male,No,Sat,Dinner,4,2.250000,18.62
216,28.15,3.00,Male,Yes,Sat,Dinner,5,0.600000,10.66
238,35.83,4.67,Female,No,Sat,Dinner,3,1.556667,13.03

In [116]:
tips_df.tail()

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percent
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,1.000000,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,1.000000,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,0.875000,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500000,15.97

In [117]:
tips_df.iloc[3:5]

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percent
3,23.68,3.31,Male,No,Sun,Dinner,2,1.6550,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.9025,14.68

In [118]:
tips_df.loc[3:5]

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percent
3,23.68,3.31,Male,No,Sun,Dinner,2,1.6550,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.9025,14.68
5,25.29,4.71,Male,No,Sun,Dinner,4,1.1775,18.62

In [119]:
tips_df.tail(6)

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percent
238,35.83,4.67,Female,No,Sat,Dinner,3,1.556667,13.03
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,1.000000,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,1.000000,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,0.875000,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500000,15.97

In [ ]:
tips_df.loc[3]  # gives you the value with the id 1 according to the dataframe

total_bill          23.68
tip                  3.31
sex                  Male
smoker                 No
day                   Sun
time               Dinner
size                    2
tips_per_person     1.655
tip_percent         13.98
Name: 3, dtype: object

In [22]:
tips_df.tail(6).loc[1] #won't work because index 1 is not there

KeyError: 1

In [11]:
tips_df.tail(6).iloc[2:4]  # iloc gives you the rows in that index exclusive of the last value in the slice

     total_bill  tip     sex smoker  day    time  size
240       27.18  2.0  Female    Yes  Sat  Dinner     2
241       22.67  2.0    Male    Yes  Sat  Dinner     2

In [127]:
tips_df.tail(6).loc[240:241,'tip']

240    2.0
241    2.0
Name: tip, dtype: float64

In [125]:
tips_df.tail(6).loc[240:241,['tip','size']]

     tip  size
240  2.0     2
241  2.0     2

# Slicing columns using range of columns

In [128]:
tips_df.tail(6).loc[240:241, "tip":"size"]

     tip     sex smoker  day    time  size
240  2.0  Female    Yes  Sat  Dinner     2
241  2.0    Male    Yes  Sat  Dinner     2

In [ ]:
tips_df.tail(6).loc[240:241, "tip"]  # A column
tips_df.tail(6).loc[240:241, ["tip", "size"]]  # Multiple columns
tips_df.tail(6).loc[240:241, "tip":"size"]  # Range of columns

In [129]:
tips_df.iloc[2:4, 1:7]

    tip   sex smoker  day    time  size
2  3.50  Male     No  Sun  Dinner     3
3  3.31  Male     No  Sun  Dinner     2

# All rows but only columns from tip to day

In [134]:
tips_df.iloc[:-1,1:5]

      tip     sex smoker  day
0    1.01  Female     No  Sun
1    1.66    Male     No  Sun
2    3.50    Male     No  Sun
3    3.31    Male     No  Sun
4    3.61  Female     No  Sun
..    ...     ...    ...  ...
238  4.67  Female     No  Sat
239  5.92    Male     No  Sat
240  2.00  Female    Yes  Sat
241  2.00    Male    Yes  Sat
242  1.75    Male     No  Sat

[243 rows x 4 columns]

In [14]:
tips_df.loc[0:245, 'tip':'day']

      tip     sex smoker   day
0    1.01  Female     No   Sun
1    1.66    Male     No   Sun
2    3.50    Male     No   Sun
3    3.31    Male     No   Sun
4    3.61  Female     No   Sun
..    ...     ...    ...   ...
239  5.92    Male     No   Sat
240  2.00  Female    Yes   Sat
241  2.00    Male    Yes   Sat
242  1.75    Male     No   Sat
243  3.00  Female     No  Thur

[244 rows x 4 columns]

# Task 1
Retrieve and list the entries, sorting them from highest to lowest by `tip_percent`, excluding the first five results, specifically for weekends (Saturday and Sunday).

In [23]:
tips_df.sort_values(by="tip_percent").loc[5:,:]

     total_bill   tip     sex smoker  day    time  size  tip_percent
5         25.29  4.71    Male     No  Sun  Dinner     4        18.62
212       48.33  9.00    Male     No  Sat  Dinner     4        18.62
223       15.98  3.00  Female     No  Fri   Lunch     3        18.77
169       10.63  2.00  Female    Yes  Sat  Dinner     2        18.81
213       13.27  2.50  Female    Yes  Sat  Dinner     2        18.84
..          ...   ...     ...    ...  ...     ...   ...          ...
183       23.17  6.50    Male    Yes  Sun  Dinner     4        28.05
232       11.61  3.39    Male     No  Sat  Dinner     2        29.20
67         3.07  1.00  Female    Yes  Sat  Dinner     1        32.57
178        9.60  4.00  Female    Yes  Sun  Dinner     2        41.67
172        7.25  5.15    Male    Yes  Sun  Dinner     2        71.03

[68 rows x 8 columns]